src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияКонец</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 07.07.2026</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	//++ВКМ(ДОБАВЛЕНИЕ), Д.Р.Самжилин, 29.07.2026	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения);
	//--ВКМ(Конец ДОБАВЛЕНИЯ), Д.Р.Самжилин, 29.07.2026
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ВКМ(ДОБАВЛЕНИЕ), Д.Р.Самжилин, 29.07.2026
Процедура ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
		
КонецПроцедуры //--ВКМ(Конец ДОБАВЛЕНИЯ), Д.Р.Самжилин, 29.07.2026

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	//++ВКМ(ДОБАВЛЕНИЕ) Д.Р.Самжилин, 20.08.2026

		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		НомРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			
	//--ВКМ(Конец ДОБАВЛЕНИЯ) Д.Р.Самжилин, 20.08.2026
	
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
			//++ВКМ(ДОБАВЛЕНИЕ) Д.Р.Самжилин, 20.08.2026
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		
		Если ТекСтрокаУслуги.Номенклатура = НомРаботыСпециалиста Тогда
				
			ДвижениеВыполненныеРаботы = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьРасход();
			ДвижениеВыполненныеРаботы.Период = Дата;
			ДвижениеВыполненныеРаботы.Клиент = Контрагент;
			ДвижениеВыполненныеРаботы.Договор = Договор;
			ДвижениеВыполненныеРаботы.КоличествоЧасов = ТекСтрокаУслуги.Количество;
			ДвижениеВыполненныеРаботы.СуммаКОплате = ТекСтрокаУслуги.Сумма;
				
		КонецЕсли;
			
	КонецЦикла;
					
		//--ВКМ(Конец ДОБАВЛЕНИЯ) Д.Р.Самжилин, 20.08.2026

КонецПроцедуры

//++ВКМ(ДОБАВЛЕНИЕ), Д.Р.Самжилин, 16.07.2026
Процедура ВыполнитьАвтозаполнение() Экспорт
	
	Если ЭтоДоговорАбонентскогоОбслуживания(Договор) Тогда
		
		НомАбонентскаяПлата = Константы.ВКМ_НоменклатураАбоненсткаяПлата.Получить();
		НомРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		ЕстьОшибка = Ложь;
		
		Если Не ЗначениеЗаполнено(НомАбонентскаяПлата) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнена номенклатура абонентской платы!");
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НомРаботыСпециалиста) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнена номенклатура работы специалиста!");
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
		
		Услуги.Очистить();
		
		ДанныеЗаполнения = ПолучитьДанныеЗаполненияПоАбонентскойПлате();
		
		Если ДанныеЗаполнения.Следующий() Тогда
			
			Если ДанныеЗаполнения.СуммаАбонентскойПлаты > 0 Тогда
				
				НоваяСтрока = Услуги.Добавить();
				НоваяСтрока.Номенклатура = НомАбонентскаяПлата;
				НоваяСтрока.Количество = 1;
				НоваяСтрока.Цена = ДанныеЗаполнения.СуммаАбонентскойПлаты;
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			
			КонецЕсли;
			
			Если ДанныеЗаполнения.СуммаКОплате > 0 Тогда
				
				НоваяСтрока = Услуги.Добавить();
				НоваяСтрока.Номенклатура = НомРаботыСпециалиста;
				НоваяСтрока.Количество = ДанныеЗаполнения.КоличествоЧасов;
				НоваяСтрока.Цена = ДанныеЗаполнения.СуммаКОплате / ДанныеЗаполнения.КоличествоЧасов;
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СуммаДокумента = Услуги.Итог("Сумма") + Товары.Итог("Сумма");
		
	КонецЕсли;
		
КонецПроцедуры //--ВКМ(Конец ДОБАВЛЕНИЯ), Д.Р.Самжилин, 16.07.2026

//++ВКМ(ДОБАВЛЕНИЕ), Д.Р.Самжилин, 16.07.2026
Функция ПолучитьДанныеЗаполненияПоАбонентскойПлате()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты
	|ПОМЕСТИТЬ ВТ_АбонентскаяПлата
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот) КАК КоличествоЧасов,
	|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплате
	|ПОМЕСТИТЬ ВТ_РаботыСпециалистов
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяцаДокумента, &КонецМесяцаДокумента,,
	|		Клиент = &Контрагент
	|	И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АбонентскаяПлата.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ЕСТЬNULL(ВТ_РаботыСпециалистов.КоличествоЧасов, 0) КАК КоличествоЧасов,
	|	ЕСТЬNULL(ВТ_РаботыСпециалистов.СуммаКОплате, 0) КАК СуммаКОплате
	|ИЗ
	|	ВТ_РаботыСпециалистов КАК ВТ_РаботыСпециалистов
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_АбонентскаяПлата КАК ВТ_АбонентскаяПлата
	|		ПО ИСТИНА";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НачалоМесяцаДокумента", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяцаДокумента", КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции //--ВКМ(Конец ДОБАВЛЕНИЯ), Д.Р.Самжилин, 16.07.2026

//++ВКМ(ДОБАВЛЕНИЕ), Д.Р.Самжилин, 26.07.2026
Функция ЭтоДоговорАбонентскогоОбслуживания(Договор)
	
	ЭтоАбонентскоеОбслуживание = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание) КАК
	|		ЭтоАбонентскоеОбслуживание
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтоАбонентскоеОбслуживание = Выборка.ЭтоАбонентскоеОбслуживание;
	КонецЕсли;
	
	Возврат ЭтоАбонентскоеОбслуживание;
	
КонецФункции //--ВКМ(Конец ДОБАВЛЕНИЯ), Д.Р.Самжилин, 26.07.2026

#КонецОбласти

#КонецЕсли
